Name: Tejaswini Gokanakonda

Roll No:DE142

Date:21-11-2024

In [1]:
from pyspark.sql import SparkSession


# Initialize SparkSession
spark = SparkSession.builder \
.appName("example") \
.getOrCreate()
# Data
simpleData = [("James","Sales","NY",90000,34,10000),
("Michael","Sales","NY",86000,56,20000),
("Robert","Sales","CA",81000,30,23000),
("Maria","Finance","CA",90000,24,23000),
("Raman","Finance","CA",99000,40,24000),
("Scott","Finance","NY",83000,36,19000),
("Jen","Finance","NY",79000,53,15000),
("Jeff","Marketing","CA",80000,25,18000),
("Kumar","Marketing","NY",91000,50,21000)
]
# Create DataFrame
schema = ["employee_name","department","state","salary","age","bonus"]
df = spark.createDataFrame(data=simpleData, schema = schema)
df.printSchema()
df.show()

root
 |-- employee_name: string (nullable = true)
 |-- department: string (nullable = true)
 |-- state: string (nullable = true)
 |-- salary: long (nullable = true)
 |-- age: long (nullable = true)
 |-- bonus: long (nullable = true)

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|        James|     Sales|   NY| 90000| 34|10000|
|      Michael|     Sales|   NY| 86000| 56|20000|
|       Robert|     Sales|   CA| 81000| 30|23000|
|        Maria|   Finance|   CA| 90000| 24|23000|
|        Raman|   Finance|   CA| 99000| 40|24000|
|        Scott|   Finance|   NY| 83000| 36|19000|
|          Jen|   Finance|   NY| 79000| 53|15000|
|         Jeff| Marketing|   CA| 80000| 25|18000|
|        Kumar| Marketing|   NY| 91000| 50|21000|
+-------------+----------+-----+------+---+-----+

In [2]:
# groupby with sum of salaries
sumdata = df.groupBy("department").sum("salary")
sumdata.show()

+----------+-----------+
|department|sum(salary)|
+----------+-----------+
|     Sales|     257000|
|   Finance|     351000|
| Marketing|     171000|
+----------+-----------+

In [3]:
df.groupBy("department").min("salary").show()
df.groupBy("department").max("salary").show()
df.groupBy("department").avg("salary").show()
df.groupBy("department").mean("salary").show()
df.groupBy("department").count().show()

+----------+-----------+
|department|min(salary)|
+----------+-----------+
|     Sales|      81000|
|   Finance|      79000|
| Marketing|      80000|
+----------+-----------+

+----------+-----------+
|department|max(salary)|
+----------+-----------+
|     Sales|      90000|
|   Finance|      99000|
| Marketing|      91000|
+----------+-----------+

+----------+-----------------+
|department|      avg(salary)|
+----------+-----------------+
|     Sales|85666.66666666667|
|   Finance|          87750.0|
| Marketing|          85500.0|
+----------+-----------------+

+----------+-----------------+
|department|      avg(salary)|
+----------+-----------------+
|     Sales|85666.66666666667|
|   Finance|          87750.0|
| Marketing|          85500.0|
+----------+-----------------+

+----------+-----+
|department|count|
+----------+-----+
|     Sales|    3|
|   Finance|    4|
| Marketing|    2|
+----------+-----+

In [4]:
#grouping by multiple columns
df.groupBy("employee_name","department").min("salary").show()
df.groupBy("employee_name","department").max("salary").show()
df.groupBy("employee_name","department").avg("salary").show()
df.groupBy("employee_name","department").mean("salary").show()
df.groupBy("employee_name","department").count().show()

+-------------+----------+-----------+
|employee_name|department|min(salary)|
+-------------+----------+-----------+
|      Michael|     Sales|      86000|
|        James|     Sales|      90000|
|        Maria|   Finance|      90000|
|       Robert|     Sales|      81000|
|          Jen|   Finance|      79000|
|        Raman|   Finance|      99000|
|         Jeff| Marketing|      80000|
|        Scott|   Finance|      83000|
|        Kumar| Marketing|      91000|
+-------------+----------+-----------+

+-------------+----------+-----------+
|employee_name|department|max(salary)|
+-------------+----------+-----------+
|      Michael|     Sales|      86000|
|        James|     Sales|      90000|
|        Maria|   Finance|      90000|
|       Robert|     Sales|      81000|
|          Jen|   Finance|      79000|
|        Raman|   Finance|      99000|
|         Jeff| Marketing|      80000|
|        Scott|   Finance|      83000|
|        Kumar| Marketing|      91000|
+-------------+----------+-----------+

+-------------+----------+-----------+
|employee_name|department|avg(salary)|
+-------------+----------+-----------+
|      Michael|     Sales|    86000.0|
|        James|     Sales|    90000.0|
|        Maria|   Finance|    90000.0|
|       Robert|     Sales|    81000.0|
|          Jen|   Finance|    79000.0|
|        Raman|   Finance|    99000.0|
|         Jeff| Marketing|    80000.0|
|        Scott|   Finance|    83000.0|
|        Kumar| Marketing|    91000.0|
+-------------+----------+-----------+

+-------------+----------+-----------+
|employee_name|department|avg(salary)|
+-------------+----------+-----------+
|      Michael|     Sales|    86000.0|
|        James|     Sales|    90000.0|
|        Maria|   Finance|    90000.0|
|       Robert|     Sales|    81000.0|
|          Jen|   Finance|    79000.0|
|        Raman|   Finance|    99000.0|
|         Jeff| Marketing|    80000.0|
|        Scott|   Finance|    83000.0|
|        Kumar| Marketing|    91000.0|
+-------------+----------+-----------+

+-------------+----------+-----+
|employee_name|department|count|
+-------------+----------+-----+
|      Michael|     Sales|    1|
|        James|     Sales|    1|
|        Maria|   Finance|    1|
|       Robert|     Sales|    1|
|          Jen|   Finance|    1|
|        Raman|   Finance|    1|
|         Jeff| Marketing|    1|
|        Scott|   Finance|    1|
|        Kumar| Marketing|    1|
+-------------+----------+-----+

In [5]:
#using pivot function
df.groupBy("department").sum("salary").show()
df.groupBy("department").pivot("employee_name").sum("salary").show()

+----------+-----------+
|department|sum(salary)|
+----------+-----------+
|     Sales|     257000|
|   Finance|     351000|
| Marketing|     171000|
+----------+-----------+

+----------+-----+-----+-----+-----+-----+-------+-----+------+-----+
|department|James| Jeff|  Jen|Kumar|Maria|Michael|Raman|Robert|Scott|
+----------+-----+-----+-----+-----+-----+-------+-----+------+-----+
|     Sales|90000| NULL| NULL| NULL| NULL|  86000| NULL| 81000| NULL|
|   Finance| NULL| NULL|79000| NULL|90000|   NULL|99000|  NULL|83000|
| Marketing| NULL|80000| NULL|91000| NULL|   NULL| NULL|  NULL| NULL|
+----------+-----+-----+-----+-----+-----+-------+-----+------+-----+

In [6]:
from pyspark.sql import SparkSession


# Initialize SparkSession
spark = SparkSession.builder \
.appName("example") \
.getOrCreate()
# Data
simpleData = [("James","Sales","NY",90000,34,10000),
("Michael","Sales","NY",86000,56,20000),
("Robert","Sales","CA",81000,None,23000),
("Maria","Finance","CA",90000,24,23000),
("Raman","Finance","CA",99000,40,None),
("Scott","Finance","NY",None,36,44000),
("Jen","Finance","NY",55000,53,15000),
("Jeff",None,"CA",80000,25,18000),
("null","Marketing","NY",91000,50,21000)
]
# Create DataFrame
schema = ["employee_name","department","state","salary","age","bonus"]
dfa = spark.createDataFrame(data=simpleData, schema = schema)
dfa.na.drop().show()

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|        James|     Sales|   NY| 90000| 34|10000|
|      Michael|     Sales|   NY| 86000| 56|20000|
|        Maria|   Finance|   CA| 90000| 24|23000|
|          Jen|   Finance|   NY| 55000| 53|15000|
|         null| Marketing|   NY| 91000| 50|21000|
+-------------+----------+-----+------+---+-----+

In [7]:
from pyspark.sql import SparkSession


# Initialize SparkSession
spark = SparkSession.builder \
.appName("example") \
.getOrCreate()
# Data
simpleData = [("James","Sales","NY",90000,34,10000),
("Michael","Sales","NY",86000,56,20000),
("Robert","Sales","CA",81000,None,23000),
("Maria","Finance","CA",90000,24,23000),
("Raman","Finance","CA",99000,40,None),
("Scott","Finance","NY",None,36,44000),
("Jen","Finance","NY",55000,53,15000),
("Jeff",None,"CA",80000,25,18000),
("null","Marketing","NY",91000,50,21000)
]
# Create DataFrame
schema = ["employee_name","department","state","salary","age","bonus"]
dfa = spark.createDataFrame(data=simpleData, schema = schema)
dfa.show()

+-------------+----------+-----+------+----+-----+
|employee_name|department|state|salary| age|bonus|
+-------------+----------+-----+------+----+-----+
|        James|     Sales|   NY| 90000|  34|10000|
|      Michael|     Sales|   NY| 86000|  56|20000|
|       Robert|     Sales|   CA| 81000|NULL|23000|
|        Maria|   Finance|   CA| 90000|  24|23000|
|        Raman|   Finance|   CA| 99000|  40| NULL|
|        Scott|   Finance|   NY|  NULL|  36|44000|
|          Jen|   Finance|   NY| 55000|  53|15000|
|         Jeff|      NULL|   CA| 80000|  25|18000|
|         null| Marketing|   NY| 91000|  50|21000|
+-------------+----------+-----+------+----+-----+

In [8]:
df.groupBy("department").agg(({"salary":"sum"})).show()
df.agg(({"salary":"sum"})).show()  # Without group using agg on salary colums

+----------+-----------+
|department|sum(salary)|
+----------+-----------+
|     Sales|     257000|
|   Finance|     351000|
| Marketing|     171000|
+----------+-----------+

+-----------+
|sum(salary)|
+-----------+
|     779000|
+-----------+

In [9]:
df.show()

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|        James|     Sales|   NY| 90000| 34|10000|
|      Michael|     Sales|   NY| 86000| 56|20000|
|       Robert|     Sales|   CA| 81000| 30|23000|
|        Maria|   Finance|   CA| 90000| 24|23000|
|        Raman|   Finance|   CA| 99000| 40|24000|
|        Scott|   Finance|   NY| 83000| 36|19000|
|          Jen|   Finance|   NY| 79000| 53|15000|
|         Jeff| Marketing|   CA| 80000| 25|18000|
|        Kumar| Marketing|   NY| 91000| 50|21000|
+-------------+----------+-----+------+---+-----+

In [10]:
df.sort("bonus").show()
df.sort(df["salary"].desc()).show()
df.orderBy("salary").show()

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|        James|     Sales|   NY| 90000| 34|10000|
|          Jen|   Finance|   NY| 79000| 53|15000|
|         Jeff| Marketing|   CA| 80000| 25|18000|
|        Scott|   Finance|   NY| 83000| 36|19000|
|      Michael|     Sales|   NY| 86000| 56|20000|
|        Kumar| Marketing|   NY| 91000| 50|21000|
|       Robert|     Sales|   CA| 81000| 30|23000|
|        Maria|   Finance|   CA| 90000| 24|23000|
|        Raman|   Finance|   CA| 99000| 40|24000|
+-------------+----------+-----+------+---+-----+

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|        Raman|   Finance|   CA| 99000| 40|24000|
|        Kumar| Marketing|   NY| 91000| 50|21000|
|        James|     Sales|   NY| 90000| 34|10000|
|        Maria|   Finance|   CA| 90000| 24|23000|
|      Michael|     Sales|   NY| 86000| 56|20000|
|        Scott|   Finance|   NY| 83000| 36|19000|
|       Robert|     Sales|   CA| 81000| 30|23000|
|         Jeff| Marketing|   CA| 80000| 25|18000|
|          Jen|   Finance|   NY| 79000| 53|15000|
+-------------+----------+-----+------+---+-----+

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|          Jen|   Finance|   NY| 79000| 53|15000|
|         Jeff| Marketing|   CA| 80000| 25|18000|
|       Robert|     Sales|   CA| 81000| 30|23000|
|        Scott|   Finance|   NY| 83000| 36|19000|
|      Michael|     Sales|   NY| 86000| 56|20000|
|        James|     Sales|   NY| 90000| 34|10000|
|        Maria|   Finance|   CA| 90000| 24|23000|
|        Kumar| Marketing|   NY| 91000| 50|21000|
|        Raman|   Finance|   CA| 99000| 40|24000|
+-------------+----------+-----+------+---+-----+